## Terraform TFPlan Output for `ec2-instance`
  

```hcl
[command]/home/runner/work/_temp/9d7105e4-9acd-43ae-93b0-1aac2002fee9/terraform-bin plan -no-color
data.terraform_remote_state.ec2: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_s3_bucket.krishna-tf-s3bucket will be created
  + resource "aws_s3_bucket" "krishna-tf-s3bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "krishna-tf-s3bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Creator" = "Krishna Pathak"
          + "Name"    = "S3Bucket"
        }
      + tags_all                    = {
          + "Creator" = "Krishna Pathak"
          + "Name"    = "S3Bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Error: Unable to find remote state

  with data.terraform_remote_state.ec2,
  on main.tf line 1, in data "terraform_remote_state" "ec2":
   1: data "terraform_remote_state" "ec2" {

No stored state was found for the given workspace in the given backend.
::debug::Terraform exited with code 1.
::debug::stdout: data.terraform_remote_state.ec2: Reading...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform planned the following actions, but then encountered a problem:%0A%0A  # aws_s3_bucket.krishna-tf-s3bucket will be created%0A  + resource "aws_s3_bucket" "krishna-tf-s3bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "krishna-tf-s3bucket"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Creator" = "Krishna Pathak"%0A          + "Name"    = "S3Bucket"%0A        }%0A      + tags_all                    = {%0A          + "Creator" = "Krishna Pathak"%0A          + "Name"    = "S3Bucket"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + cors_rule (known after apply)%0A%0A      + grant (known after apply)%0A%0A      + lifecycle_rule (known after apply)%0A%0A      + logging (known after apply)%0A%0A      + object_lock_configuration (known after apply)%0A%0A      + replication_configuration (known after apply)%0A%0A      + server_side_encryption_configuration (known after apply)%0A%0A      + versioning (known after apply)%0A%0A      + website (known after apply)%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: %0AError: Unable to find remote state%0A%0A  with data.terraform_remote_state.ec2,%0A  on main.tf line 1, in data "terraform_remote_state" "ec2":%0A   1: data "terraform_remote_state" "ec2" {%0A%0ANo stored state was found for the given workspace in the given backend.%0A
::debug::exitcode: 1

::set-output name=stdout::data.terraform_remote_state.ec2: Reading...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform planned the following actions, but then encountered a problem:%0A%0A  # aws_s3_bucket.krishna-tf-s3bucket will be created%0A  + resource "aws_s3_bucket" "krishna-tf-s3bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "krishna-tf-s3bucket"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Creator" = "Krishna Pathak"%0A          + "Name"    = "S3Bucket"%0A        }%0A      + tags_all                    = {%0A          + "Creator" = "Krishna Pathak"%0A          + "Name"    = "S3Bucket"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + cors_rule (known after apply)%0A%0A      + grant (known after apply)%0A%0A      + lifecycle_rule (known after apply)%0A%0A      + logging (known after apply)%0A%0A      + object_lock_configuration (known after apply)%0A%0A      + replication_configuration (known after apply)%0A%0A      + server_side_encryption_configuration (known after apply)%0A%0A      + versioning (known after apply)%0A%0A      + website (known after apply)%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A

::set-output name=stderr::%0AError: Unable to find remote state%0A%0A  with data.terraform_remote_state.ec2,%0A  on main.tf line 1, in data "terraform_remote_state" "ec2":%0A   1: data "terraform_remote_state" "ec2" {%0A%0ANo stored state was found for the given workspace in the given backend.%0A

::set-output name=exitcode::1
::error::Terraform exited with code 1.

```